# üåê Hybrid RIP‚ÄìOSPF Network Simulation (Cisco Packet Tracer)

## üìò Project Overview

This project demonstrates a **hybrid routing setup** combining both **RIP (Routing Information Protocol)** and **OSPF (Open Shortest Path First)** to achieve scalable and efficient routing across multiple subnet domains.

The network is designed and simulated using **Cisco Packet Tracer**, consisting of **three OSPF domains** interconnected via **backbone routers (R1, R5, R9)**. Each OSPF domain is connected to a corresponding **RIP-based internal LAN**. 

This design allows seamless communication between multiple autonomous systems using **route redistribution** between RIP and OSPF.

---

## üß© Network Architecture

The topology is divided into **three major regions**:

| Region | Protocol | Core Router | Internal Routers | LANs |
|:------:|:----------|:-------------|:------------------|:------|
| Region 1 | RIP + OSPF | R1 | R2, R3, R4 | PC-A, Server, Laptop-A, PC-B, PC-C |
| Region 2 | RIP + OSPF | R5 | R6, R7, R8 | PC-D, IP Phone, PC-E, PC-F |
| Region 3 | RIP + OSPF | R9 | R10, R11, R12 | PC-G, PC-K, PC-L, Laptop-E |

<h1></h1>
<img width="916" height="289" alt="Image" src="https://github.com/user-attachments/assets/f12f3ab5-17c5-4513-99c4-32b3f13b146d" />

---

## üîÅ Routing Setup

### üü£ RIP Configuration
RIP (Routing Information Protocol) is used inside each local region to maintain **simple and dynamic distance-vector routing** among the internal routers.

**RIP Features:**
- Distance Vector Protocol
- Uses Hop Count as metric
- Max hop count: 15
- Classful (RIPv1) or Classless (RIPv2)
- Periodic updates every 30 seconds

**Configuration Example (Router R2):**
```bash
Router(config)# router rip
Router(config-router)# version 2
Router(config-router)# network 192.168.1.0
Router(config-router)# network 192.168.2.0
Router(config-router)# no auto-summary
```
# üü£ RIP Configuration (Expanded)

The **Routing Information Protocol (RIP)** is implemented within each local area (region) to dynamically manage routing tables between routers **R2‚ÄìR4**, **R6‚ÄìR8**, and **R10‚ÄìR12**.  
It enables routers inside each autonomous system (AS) to **learn routes automatically**, eliminating the need for static route configuration.

---

## ‚öôÔ∏è Purpose of Using RIP

- **Ease of Configuration:** RIP is one of the simplest dynamic routing protocols to implement.  
- **Automatic Route Updates:** It periodically shares routing information with neighbors.  
- **Stability in Small Networks:** Since each local region in this topology is limited in size, RIP‚Äôs simplicity is advantageous.  
- **Interoperability:** RIP (particularly RIPv2) can be redistributed easily into OSPF ‚Äî making it ideal for this hybrid setup.

---

## üß† RIP Working Principle

RIP uses a **distance-vector algorithm**, where:
- Routers exchange their **entire routing table** every **30 seconds**.  
- The metric used is **hop count** (number of routers to reach a destination).  
- A **maximum hop count of 15** ensures that the network remains stable and loop-free.  
  (A hop count of 16 is considered **unreachable**.)

Each router advertises its connected networks to neighbors using **UDP port 520**.  

When a router receives a RIP update:
1. It **increments** the hop count of each received route by 1.  
2. **Updates** its routing table if the new route offers a better (smaller) hop count.  
3. **Propagates** updated information in the next periodic update cycle.

---

## üßæ RIP Versions

| Version | Description | Key Feature |
|:--------:|:-------------|:-------------|
| **RIPv1** | Classful routing protocol | Does not support subnet masks or VLSM |
| **RIPv2** | Classless routing protocol | Supports subnet masks, VLSM, authentication, and multicast updates (224.0.0.9) |

üëâ In this project, **RIPv2** is used for compatibility with OSPF and support for **VLSM (Variable Length Subnet Masking)**.

---

## üß± RIP Configuration Steps (Example on Router R2)

1. **Enter Global Configuration Mode:**
   ```bash
   Router> enable
   Router# configure terminal
   ```

2. **Start RIP Routing Process:**
   ```bash
   Router(config)# router rip
   ```

3. **Set RIP Version to 2:**
   ```bash
   Router(config-router)# version 2
   ```
   This ensures RIPv2 advertisements (supports classless addressing and subnet masks).

4. **Advertise Directly Connected Networks:**
   ```bash
   Router(config-router)# network 192.168.1.0
   Router(config-router)# network 192.168.2.0
   ```
   This tells the router to include these networks in RIP updates.

5. **Disable Automatic Summarization:**
   ```bash
   Router(config-router)# no auto-summary
   ```
   This prevents RIP from automatically summarizing routes at major network boundaries (critical when using subnets).

6. **Exit and Save Configuration:**
   ```bash
   Router(config-router)# exit
   Router(config)# end
   Router# write memory
   ```

---

## üß© Example: Full RIP Configuration on Region 1 Routers

**Router R2**
```bash
router rip
version 2
network 192.168.1.0
network 192.168.2.0
no auto-summary
```

**Router R3**
```bash
router rip
version 2
network 192.168.2.0
network 192.168.3.0
no auto-summary
```

**Router R4**
```bash
router rip
version 2
network 192.168.3.0
redistribute ospf 1 metric 2
no auto-summary
```

> üìù **Note:** Router R4 connects to the OSPF backbone router (R1), hence it includes **route redistribution** to enable bidirectional communication between the RIP and OSPF domains.

---

## üìä Verification Commands

| Purpose | Command | Description |
|:----------|:-----------|:-------------|
| View routing table | `show ip route` | Displays all RIP-learned routes (marked with ‚ÄòR‚Äô) |
| Check RIP process details | `show ip protocols` | Displays active RIP settings and advertised networks |
| Check RIP neighbors | `debug ip rip` | Shows RIP update exchanges in real-time |
| Test connectivity | `ping <destination IP>` | Verifies routing success between networks |

---

## ‚úÖ Verification Example

**Command:**
```bash
R2# show ip route
```

**Output:**
```
R    192.168.3.0/24 [120/1] via 192.168.2.2, 00:00:12, Serial0/0/0
C    192.168.1.0/24 is directly connected, FastEthernet0/0
C    192.168.2.0/24 is directly connected, Serial0/0/0
```

**Interpretation:**
- `C` ‚Äî Connected routes  
- `R` ‚Äî Routes learned via RIP  
- `[120/1]` ‚Äî Administrative distance / hop count  
- The routing table shows that Router R2 has learned the `192.168.3.0/24` network via RIP, confirming successful dynamic routing.

---

## üí° Notes and Best Practices

- Always **use RIPv2** for modern networks ‚Äî it supports subnet masks and route summarization control.  
- **Disable auto-summarization** when using discontiguous networks or variable subnets.  
- Avoid having more than **15 hops** between any two networks.  
- **Use `passive-interface`** for interfaces connected to end devices (to stop unnecessary RIP advertisements).  
  Example:
  ```bash
  Router(config-router)# passive-interface FastEthernet0/0
  ```
- Save configurations using:
  ```bash
  Router# write memory
  ```
- Combine with **route redistribution** at border routers to ensure full connectivity with OSPF networks.

---

‚úÖ **RIP configuration successfully establishes intra-domain routing** within each region, laying the foundation for hybrid integration with OSPF.
